'''
Имеется реализованная функция f(x)f(x), принимающая на вход целое число xx, которая вычисляет некоторое целочисленое значение и возвращает его в качестве результата работы.

Функция вычисляется достаточно долго, ничего не выводит на экран, не пишет в файлы и зависит только от переданного аргумента xx.

Напишите программу, которая вычисляет значение этой функции для nn чисел.

Для ускорения вычисления необходимо сохранять уже вычисленные значения функции при известных аргументах.

Обратите внимание, что в этой задаче установлено достаточно сильное ограничение в две секунды по времени исполнения кода на тесте.

Формат ввода:
На первой строке находится число nn -− количество значений, на которых нужно посчитать функцию. После этого следует nn строк, на каждой строке по одному целому числу.

Формат вывода:
nn строк, в каждой из которой результат вычисления функции на соответствующем аргументе.

Sample Input:

5
5
12
9
20
12
Sample Output:

11
41
47
61
41
'''

# Считайте, что функция f(x) уже определена выше. Определять её отдельно не требуется.

numbers = {}
for i in range(int(input())):
    m = int(input())
    if m not in numbers:
        numbers[m] = f(m)
    print(numbers[m])


