'''
Кодирование длин серий — это базовый алгоритм сжатия данных.

В этой задаче мы реализуем одну из самых простых его вариантов.

На вход алгоритму подаётся строка, содержащая символы латинского алфавита.
Эта строка разбивается на группы одинаковых символов, идущих подряд ("серии").
Каждая серия характеризуется повторяющимся символом и количеством повторений.
Именно эта информация и записывается в код: сначала пишется длина серии повторяющихся символов, затем сам символ.
У серий длиной в один символ количество повторений будем опускать.

Например, рассмотрим строку
aaabccccCCaB
Разобъём её на серии
aaa b cccc CC a B
После чего закодируем серии и получим итоговую строку, которую и будем считать результатом работы алгоритма.
3ab4c2CaB
'''


def split_encode_series(string):
    # Функция, которая принимает строку на вход, а возвращает список пар (длина серии, символ):
    count = 1
    string += ' '
    for i, key in enumerate(string[:-1]):
        if key == string[i + 1]:
            count += 1
        else:
            yield count, key
            count = 1


def encode_series(series):
    # Функцию, которая принимает на вход последовательность серий, а возвращает закодированную строку:
    result = ''
    for i in series:
        result += str(i[0]) + i[1] if i[0] > 1 else i[1]
    return result


def rle_encode(string):
    string = split_encode_series(string)
    return encode_series(string)


print(rle_encode(input()))
