'''
Поле для игры сапёр представляет собой сетку размером n \times mn×m. В ячейке сетки может находиться или отсутствовать мина.

Напишите программу, которая выводит "решённое" поле, т.е. для каждой ячейки, не являющейся миной, указывается число мин, находящихся в соседних ячейках (учитывая диагональные направления)

Формат ввода:
На первой строке указываются два натуральных числа 1 \le n,m \le 1001≤n,m≤100, после чего в nn строках содержится описание поля в виде последовательности точек '.' и звёздочек '*', где точка означает пустую ячейку, а звёздочка − ячейку с миной.

Формат вывода:
nn строк поля, в каждой ячейке которого будет либо число от 0 до 8, либо мина (обозначенная символом "*"), при этом число означает количество мин в соседних ячейках поля.

Sample Input:

4 4
..*.
**..
..*.
....
Sample Output:

23*1
**32
23*1
0111
'''

n, m = map(int, input().strip().split())
mines_list = [list(input()) for j in range(n)]
for i in range(n):
    for j in range(m):
        count = 0
        if mines_list[i][j] != '*':
            for di in range(-1, 2):
                for dj in range(-1, 2):
                    mines_di = i + di
                    mines_dj = j + dj
                    if (0 <= mines_di < n) and (0 <= mines_dj < m) and (mines_list[mines_di][mines_dj] == '*'):
                        count += 1
            mines_list[i][j] = count
for i in range(n):
    for j in range(m):
        print(mines_list[i][j], end='')
    print()
